<a href="https://colab.research.google.com/github/SuhoparovYD/Demo/blob/master/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Небольшое автотранспортное предприятие


*   Производственный отдел:  - водители, механики
*   


*   Отдел маркетинга: - заключение договоров с заказчиками, поиск заказчиков
*   Витрина  - кол-во договоров, выручка по договорам
*   

*   Отдел реализации: - исполнение договоров, учет поездок
*   Витрина  - кол-во поездок,  оплата
*   


*   Поездки оплачиваются заказчиками в зависимости от пункта назначения, вида груза, выделенного автомобиля.

# Создание базы

In [ ]:
from sqlalchemy import create_engine
import os
import pandas as pd

if os.path.exists("some.db"):  os.remove("some.db")
e = create_engine("sqlite:///some.db")

In [ ]:
e.execute("""
  CREATE TABLE Customers (
    id integer primary key,
    name varchar(255) NOT NULL,
    address varchar(255) NOT NULL,
    contact TEXT NOT NULL,
    tel TEXT NOT NULL,
    last_handling DATE
    )
""")

In [ ]:
e.execute("""insert into Customers(name,address,contact,tel ) values ('Блинная',"ул.Правды 3","Сонечка","25-36-27")""")
e.execute("""insert into Customers(name,address,contact,tel ) values ('маг. Канцтовары',"ул.Советов 8","Манечка","25-36-27")""")
e.execute("""insert into Customers(name,address,contact,tel ) values ('Сладкоежка',"ул.Перова 1","Дуня","25-36-27")""")
e.execute("""insert into Customers(name,address,contact,tel ) values ('маг. Пилот',"ул.Кирова 8","Михалыч","25-36-27")""")
e.execute("""insert into Customers(name,address,contact,tel ) values ('Мороженное',"ул.Мира 7","Лена","25-36-27")""")
e.execute("""insert into Customers(name,address,contact,tel ) values ('Оптовичок',"ул.Серовав 9","Кузьмич","25-36-27")""")
pd.read_sql_query('SELECT * FROM Customers;', e)

   id             name       address  contact       tel last_handling
0   1          Блинная   ул.Правды 3  Сонечка  25-36-27          None
1   2  маг. Канцтовары  ул.Советов 8  Манечка  25-36-27          None
2   3       Сладкоежка   ул.Перова 1     Дуня  25-36-27          None
3   4       маг. Пилот   ул.Кирова 8  Михалыч  25-36-27          None
4   5       Мороженное     ул.Мира 7     Лена  25-36-27          None
5   6        Оптовичок  ул.Серовав 9  Кузьмич  25-36-27          None

In [ ]:
e.execute("""
    CREATE TABLE Departments (
      id integer primary key,
      name varchar(255) NOT NULL
    )
""")

In [ ]:
e.execute("""insert into Departments(name) values ('Маркетинг')""")
e.execute("""insert into Departments(name) values ('Продажи')""")
e.execute("""insert into Departments(name) values ('Производственный')""")

pd.read_sql_query('SELECT * FROM Departments;', e)

   id              name
0   1         Маркетинг
1   2           Продажи
2   3  Производственный

In [ ]:
#e.execute("""
#    drop table Employees   n""")

In [ ]:
e.execute("""
    create table Employees (
        id integer primary key,
        fio varchar,
        departmentId integer
    )
""")

In [ ]:
e.execute("""insert into Employees(fio, departmentId) values ('Шишов А.Б.', 1)""")
e.execute("""insert into Employees(fio, departmentId) values ('Жуков Б.Г.',1)""")
e.execute("""insert into Employees(fio, departmentId) values ('Семенова А.Б.', 2)""")
e.execute("""insert into Employees(fio, departmentId) values ('Симонян Б.Г.',2)""")
e.execute("""insert into Employees(fio, departmentId) values ('Иванов Иван ИвановиЧ.', 3)""")
e.execute("""insert into Employees(fio, departmentId) values ('Петров Петр Иванович', 3)""")
e.execute("""insert into Employees(fio, departmentId) values ('Сидоров Семен Иванович.', 3)""")
e.execute("""insert into Employees(fio, departmentId) values ('Сергеев Сергей Иванович', 3)""")
e.execute("""insert into Employees(fio, departmentId) values ('Ивинов Иван ИвановиЧ.', 3)""")

pd.read_sql_query('SELECT * FROM Employees;', e)

   id                      fio  departmentId
0   1               Шишов А.Б.             1
1   2               Жуков Б.Г.             1
2   3            Семенова А.Б.             2
3   4             Симонян Б.Г.             2
4   5    Иванов Иван ИвановиЧ.             3
5   6     Петров Петр Иванович             3
6   7  Сидоров Семен Иванович.             3
7   8  Сергеев Сергей Иванович             3
8   9    Ивинов Иван ИвановиЧ.             3

In [ ]:
#e.execute("""    drop table orders """)

In [ ]:
e.execute("""
    create table Orders (
        id integer primary key,
        number integer,
        name varchar,
        managerId integer,
        customerId integer,
        date date
    )
""")

In [ ]:
e.execute("""insert into Orders(number,name, managerId, customerId ) values (1001,"Доставка продуктов",1,1)""")
e.execute("""insert into Orders(number,name, managerId, customerId ) values (1002,"Доставка Канцтоваров",1,2)""")
e.execute("""insert into Orders(number,name, managerId, customerId ) values (1004,"Доставка продуктов",1,3)""")
e.execute("""insert into Orders(number,name, managerId, customerId ) values (1005,"Доставка продуктов",2,5)""")
e.execute("""insert into Orders(number,name, managerId, customerId ) values (1006,"Доставка товаров",2,6)""")
pd.read_sql_query('SELECT * FROM Orders;', e)

   id  number                  name  managerId  customerId  date
0   1    1001    Доставка продуктов          1           1  None
1   2    1002  Доставка Канцтоваров          1           2  None
2   3    1004    Доставка продуктов          1           3  None
3   4    1005    Доставка продуктов          2           5  None
4   5    1006      Доставка товаров          2           6  None

In [ ]:
#e.execute("""    drop table Trips """)

In [ ]:
e.execute("""
  CREATE TABLE Trips (
    id integer primary key,
    description varchar(255),
    destination varchar(255),
    managerId integer,
    customerId integer,
    cargo varchar(255),
    price integer
  )
""")

In [ ]:
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Правды 3",3,1,0.8,3000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Советов", 3,2,1.2,5000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Кирова 8",4,3,0.3,7000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Мира 7  ",3,4,0.5,9000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Серова 9",3,5,1.8,5000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Анапа",4,6,1,9000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Мира 3",3,1,4,3000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Глебовка",4,2,2,7000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Краснодар",3,1,0.5,23000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Майкоп",3,3,0.7,33000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Анапа",4,4,0.2,9000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"Гайдук",4,5,1.8,11000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Мира 7 ",3,6,0.9,6000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Правды 3",4,1,0.6,9000)""")
e.execute("""insert into Trips(description, destination,managerId, customerId, cargo, price  ) values ('Подвозка',"ул.Серова 9",3,4,0.4,7000)""")
pd.read_sql_query('SELECT * FROM Trips;', e)

    id description  destination  managerId  customerId cargo  price
0    1    Подвозка  ул.Правды 3          3           1   0.8   3000
1    2    Подвозка   ул.Советов          3           2   1.2   5000
2    3    Подвозка  ул.Кирова 8          4           3   0.3   7000
3    4    Подвозка  ул.Мира 7            3           4   0.5   9000
4    5    Подвозка  ул.Серова 9          3           5   1.8   5000
5    6    Подвозка        Анапа          4           6     1   9000
6    7    Подвозка    ул.Мира 3          3           1     4   3000
7    8    Подвозка     Глебовка          4           2     2   7000
8    9    Подвозка    Краснодар          3           1   0.5  23000
9   10    Подвозка       Майкоп          3           3   0.7  33000
10  11    Подвозка        Анапа          4           4   0.2   9000
11  12    Подвозка       Гайдук          4           5   1.8  11000
12  13    Подвозка   ул.Мира 7           3           6   0.9   6000
13  14    Подвозка  ул.Правды 3          4           1   0.6   9000
14  15    Подвозка  ул.Серова 9          3           4   0.4   7000

#Отчеты о результатах работы отделов - количество заключенных договоров для отдела маркетинга,  число рейсов, выручка для отдела реализации.

Отдел маркетинга

In [ ]:
pd.read_sql_query('''SELECT e.fio as "Менеджер" ,d.number as "№ дог.", d.name as "Договор", t.price as "Выручка"
FROM Employees e, Trips t, Orders d 
where e.id = d.managerId and d.customerId = t.customerId order by e.fio, d.number   ;''', e)

      Менеджер  № дог.               Договор  Выручка
0   Жуков Б.Г.    1005    Доставка продуктов     5000
1   Жуков Б.Г.    1005    Доставка продуктов    11000
2   Жуков Б.Г.    1006      Доставка товаров     6000
3   Жуков Б.Г.    1006      Доставка товаров     9000
4   Шишов А.Б.    1001    Доставка продуктов     3000
5   Шишов А.Б.    1001    Доставка продуктов     3000
6   Шишов А.Б.    1001    Доставка продуктов     9000
7   Шишов А.Б.    1001    Доставка продуктов    23000
8   Шишов А.Б.    1002  Доставка Канцтоваров     5000
9   Шишов А.Б.    1002  Доставка Канцтоваров     7000
10  Шишов А.Б.    1004    Доставка продуктов     7000
11  Шишов А.Б.    1004    Доставка продуктов    33000

Количество заключенных договоров по менеджерам отдела маркетинга

In [ ]:
pd.read_sql_query(''' SELECT fio, count(*) as "Количество договоров"  
FROM (SELECT e.fio, d.* FROM Employees e,  Orders d where e.id = d.managerId )
group by managerId ;''', e)

          fio  Количество договоров
0  Шишов А.Б.                     3
1  Жуков Б.Г.                     2

Отдел реализации

In [ ]:
pd.read_sql_query('''SELECT e.fio as "Менеджер" , c.name as "Заказчик", t.cargo as "Груз", t.price as "Выручка"
FROM Employees e, Trips t, Customers c 
where e.id = t.managerId and c.id = customerId order by e.fio  ;''', e)

         Менеджер         Заказчик Груз  Выручка
0   Семенова А.Б.          Блинная  0.8     3000
1   Семенова А.Б.  маг. Канцтовары  1.2     5000
2   Семенова А.Б.       маг. Пилот  0.5     9000
3   Семенова А.Б.       Мороженное  1.8     5000
4   Семенова А.Б.          Блинная    4     3000
5   Семенова А.Б.          Блинная  0.5    23000
6   Семенова А.Б.       Сладкоежка  0.7    33000
7   Семенова А.Б.        Оптовичок  0.9     6000
8   Семенова А.Б.       маг. Пилот  0.4     7000
9    Симонян Б.Г.       Сладкоежка  0.3     7000
10   Симонян Б.Г.        Оптовичок    1     9000
11   Симонян Б.Г.  маг. Канцтовары    2     7000
12   Симонян Б.Г.       маг. Пилот  0.2     9000
13   Симонян Б.Г.       Мороженное  1.8    11000
14   Симонян Б.Г.          Блинная  0.6     9000

Выручка и количество перевезенного груза по менеджерам отдела реализации

In [ ]:
pd.read_sql_query(''' SELECT fio as "Менеджер", count(id) as "Рейсы", sum(cargo) as "Грузы", sum(price) as "Выручка"
FROM (SELECT e.fio, t.* FROM Employees e,  Trips t where e.id = t.managerId )
group by managerId ;''', e)

        Менеджер  Рейсы  Грузы  Выручка
0  Семенова А.Б.      9   10.8    94000
1   Симонян Б.Г.      6    5.9    52000